<script setup lang="ts">
</script>

<template>
  <div class="termsOfUse">
    <h1>利用規約</h1>
    <p>本規約は、Motion-X（以下、「本サービス」といいます。）を利用する際の条件を定めるものです。本サービスを利用するすべての方（以下、「ユーザー」といいます。）は、本規約に同意した上で、本サービスをご利用ください。</p>

    <h3>第1条（適用）</h3>
    <p>本規約は、ユーザーと本サービス運営者（以下、「運営者」といいます。）との間の本サービス利用に関する一切の関係に適用されます。</p>

    <h3>第2条（収集する情報）</h3>
    <p>運営者は、本サービスの提供にあたり、以下の情報を収集します。</p>
    <ul>
      <li>ユーザーのメールアドレス</li>
      <li>ゴルフのスコアデータ</li>
      <li>ゴルフのスイング動画</li>
      <li>身長・体重に関するデータ</li>
      <li>食事のカロリーに関するデータ</li>
    </ul>

    <h3>第3条（利用目的）</h3>
    <p>運営者は、収集した情報を以下の目的で利用します。</p>
    <ul>
      <li>本サービスの提供および改善</li>
      <li>個別の解析結果やフィードバックの提供</li>
      <li>データ分析による機能改善や新サービスの開発</li>
      <li>必要な通知やサポートの提供</li>
    </ul>

    <h3>第4条（禁止事項）</h3>
    <p>ユーザーは、本サービスの利用にあたり、以下の行為を行ってはなりません。</p>
    <ul>
      <li>法令または公序良俗に反する行為</li>
      <li>他のユーザーまたは第三者の権利を侵害する行為</li>
      <li>不正アクセスやシステムの改ざんを試みる行為</li>
      <li>運営者が不適切と判断するその他の行為</li>
    </ul>

    <h3>第5条（免責事項）</h3>
    <p>運営者は、本サービスの内容の正確性、安全性、適合性について保証するものではありません。</p>
    <p>運営者は、ユーザー間または第三者との間で生じた紛争について一切の責任を負いません。</p>
    <p>本サービスの利用により生じたいかなる損害についても、運営者は一切の責任を負わないものとします。</p>

    <h3>第6条（サービスの提供の停止等）</h3>
    <p>運営者は、以下の場合、本サービスの全部または一部の提供を中止または終了することがあります。</p>
    <ul>
      <li>システムの保守点検や更新</li>
      <li>火災、停電、天災などの不可抗力によりサービスの提供が困難な場合</li>
      <li>その他、運営者が必要と判断した場合</li>
    </ul>

    <h3>第7条（知的財産権）</h3>
    <p>本サービスに関連する一切の知的財産権は、運営者または正当な権利を有する第三者に帰属します。ユーザーは、運営者の事前許可なく、複製、転載、改変等を行うことはできません。</p>

    <h3>第8条（規約の変更）</h3>
    <p>運営者は、必要に応じて本規約を変更することがあります。変更後の規約は、本サービス上で告知した時点から効力を発生するものとします。</p>
  </div>
</template>

<style scoped>
.termsOfUse{
  background-color: #fff;
  margin-bottom: 80px;
  width: 100%;
  height: 100%;
  display: flex;
  flex-direction: column;
  align-items: center;
}
p, ul, li {
    width: 90%;
    font-size: 16px;
    color: #333;
}
ul{
  padding-left: 60px;  
}
li{
  list-style-type: disc;
}
</style>